import { Controller, Get, Post } from '@nestjs/common';

@Controller('mock')
export class DataController {
@Get('single')
public async mockDataSingleReport()
{
    return{
        "date": null,
        "fulltext": "А территорию детских садов когда будут обрабатывать?",
        "address": "2-я Болдовская 8/2",
        "department": "Водоканал",
        "category": "Прорвало трубы",
        "category group": "HZ",
        "tags": [
            "трубы",
            "прорвало",
            "подвал",
            "пятиэтажка"
        ]
    }
}

@Get('multiple')
public async mockDataMultipleReports()
{
    return [
        {   
            "date": null,
            "fulltext": "А территорию детских садов когда будут обрабатывать?",
            "address": "2-я Болдовская 8/2",
            "group": "Безопасность",
            "category": "Безопасность общественных пространств",
            "department": "Губахинский городской округ",
            "tags": [
                "садов",
                "обрабатывать",
                "детских"
            ]
        },
        {
            "date": null,
            "fulltext": "Добрый день! А врача на дом можно будет вызвать?",
            "address": "Магистральная 50",
            "group": "Здравоохранение/Медицина",
            "category": "Технические проблемы с записью на прием к врачу",
            "department": "Министерство здравоохранения",
            "tags": [
                "врача",
                "вызвать"
            ]
        },
        {
            "date": null,
            "fulltext": "На улице Гагарина дом 6 лет десять колодцы закрыты досками. УК не обращает никакого внимания.",
            "address": "Гагарина 6",
            "group": "Благоустройство",
            "category": "Открытые канализационные люки",
            "department": "Губахинский городской округ",
            "tags": [
                "колодцы закрыты",
                "УК"
        
            ]
        },
        {
            "date": null,
            "fulltext": "А второй люк остался открытым, и там не видно дна, т. е. Глубины большой.",
            "address": "Ленина 20",
            "group": "Благоустройство",
            "category": "Открытые канализационные люки",
            "department": "Губахинский городской округ",
            "tags": [
                "люк",
                "открытым"
        
            ]
        },
        {
            "date": null,
            "fulltext": "Почему завалили мусором город? Почему не убирают",
            "address": "Малунцева 6",
            "group": "Благоустройство",
            "category": "Уборка территорий",
            "department": "Лысьвенский городской округ",
            "tags": [
                "завалаили мусором",
                "не убирают"
        
            ]
        },
        {
            "date": null,
            "fulltext": "Здравствуйте! Хочу поинтересоваться. Могут ли взиматься с выпускника деньги за получение аттестат ученика 9 класса?",
            "address": "Магистральная 52",
            "group": "Образование",
            "category": "Образовательный процесс",
            "department": "Министерство образования",
            "tags": [
                "выпускника",
                "аттестат",
                "класса"
            ]
        },
        {
            "date": null,
            "fulltext": "А Суворова 29 когда будут сносить дом?",
            "address": "Суворова 29",
            "group": "Социальное обслуживание и защита",
            "category": "Аварийное жилье/переселение",
            "department": "Лысьвенский городской округ",
            "tags": [
                "сносить",
                "дом"
              
            ]
        },
        {
            "date": null,
            "fulltext": "По ул.Ленина пока лампы не горят. Время-21,30.",
            "address": "Ленина 40",
            "group": "Благоустройство",
            "category": "Неисправные фонари освещения",
            "department": "Бардымский муниципальный округ Пермского края",
            "tags": [
                "лампы",
                "не горят"
              
            ]
        },
        {
            "date": null,
            "fulltext": "Здравствуйте может кто-то поможет городу Красновишерск полный бардак везде мусор",
            "address": "Багратиона 12",
            "group": "Мусор/Свалки/ТКО",
            "category": "Уборка/Вывоз мусора",
            "department": "АО ПРО ТКО",
            "tags": [
                "полный бардак",
                "везде мусор"
              
            ]
        },
        {
            "date": null,
            "fulltext": "я в положении вызвала врача на дом так и не приехал ни кто, в итоге позвонила на следующий день мне сказали выезжаем только к людям старше 60 лет вышел приказ минздрава это было на Репина 21",
            "address": "Репина 21",
            "group": "Здравоохранение/Медицина",
            "category": "Оказание медицинской помощи не в полном объеме/отказ в оказании медицинской помощи",
            "department": "Министерство здравоохранения",
            "tags": [
                "вызвала врача",
                "не приехал ни кто"
              
            ]
        },
        {
            "date": null,
            "fulltext": "До ГКП 4 невозможно дозвониться ни по одному из номеров. За сегодня совершила более 60 попыток дозвона - или занято или не берут. ПЦР положительный от 24.01, приехали 26.01, обещали повторно приехать на ПЦР через 10 дней, но тишина.",
            "address": "Истомина 67",
            "group": "Здравоохранение/Медицина",
            "category": "Технические проблемы с записью на прием к врачу",
            "department": "Министерство здравоохранения",
            "tags": [
                "невозможно дозвониться",
                "не берут",
                "тишина"
              
            ]
        },
        {
            "date": null,
            "fulltext": "До ГКП 4 невозможно дозвониться ни по одному из номеров. За сегодня совершила более 60 попыток дозвона - или занято или не берут. ПЦР положительный от 24.01, приехали 26.01, обещали повторно приехать на ПЦР через 10 дней, но тишина.",
            "address": "Мира 2",
            "group": "Здравоохранение/Медицина",
            "category": "Технические проблемы с записью на прием к врачу",
            "department": "Министерство здравоохранения",
            "tags": [
                "невозможно дозвониться",
                "не берут",
                "тишина"
              
            ]
        },
        {
            "date": null,
            "fulltext": "Хочу быть мэром! Я бы весь город сама лично отмыла и проконтролировала. Обожаю чистоту и порядок!!! У меня в Левшино лёд не чистят у подъезда, все люди уже ноги себе переломали",
            "address": "Маркса 90",
            "group": "Благоустройство",
            "category": "Нарушение правил уборки от снега и наледи внутридворового проезда, тротуара, площади",
            "department": "ИГЖН ПК",
            "tags": [
                "лёд",
                "не чистят у подъезда"
              
            ]
        },
        
        {
            "date": null,
            "fulltext": "На вышке целинная 31Б вообще завалили проход и магазин горой снега, это как вообще?!",
            "address": "Целинная 31Б",
            "group": "Благоустройство",
            "category": "Нарушение правил уборки и вывоза загрязненного снега и наледи на газоне",
            "department": "Город Пермь",
            "tags": [
                "завалили проход",
                "горой снега"
              
            ]
        },
        {
            "date": null,
            "fulltext": "Мало то что снега по уши, ещё и отопления и горячей воды нет. Субботу сидели без отопления и гор. воды и сегодня (понедельник)Плюсом управляющая компания берет деньги, а не убирается в подъездах совсем.Ул. Чернышевского",
            "address": "Чернышевского 33",
            "group": "ЖКХ",
            "category": "Ненадлежащее качество или отсутствие отопления",
            "department": "ИГЖН ПК",
            "tags": [
                "без отопления",
                "отопления и горячей воды нет"
              
            ]
        },
        {
            "date": null,
            "fulltext": "Нужно администрации сделать тротуар и ограждение, а то получается приходится ходить по обочине дороги со страхом тк машины летают!!",
            "address": "Дзержинского 7",
            "group": "Дороги",
            "category": "Содержание, ремонт и обустройство тротуаров",
            "department": "Александровский муниципальный округ Пермского края",
            "tags": [
                "сделать тротуар и ограждение",
                "проходиться ходить по обочине"
              
            ]
        },
        {
            "date": null,
            "fulltext": "В Перми улицу Плеханова залило горячей водой.",
            "address": "Плеханова 1",
            "group": "ЖКХ",
            "category": "Прорыв трубы/трубопровода",
            "department": "Город Пермь",
            "tags": [
                "залило",
                "горячей водой"
            ]
        },
        {
            "date": null,
            "fulltext": "У нас в городе нет ни одной остановки, где бы не висели объявления. Пора бы уже что то предпринимать. Можно же сделать для объявлений специальные места. Вдобавок к этому некоторые остановки поломаны и осколки стекол держаться за счет этих же объявлений",
            "address": "Поворотная 30",
            "group": "Общественный транспорт",
            "category": "Содержание остановок",
            "department": "Город Пермь",
            "tags": [
                "нет ни одной остановки",
                "специальные места",
                "остановки поломаны",
                "осколки стекол"
            ]
        },
        {
            "date": null,
            "fulltext": "Здравствуйте! Специалисты обещали позвонить в пятницу, край понедельник по моему вопросу, звонка так и не было",
            "address": "Северная 44",
            "group": "Социальное обслуживание и защита",
            "category": "Оказание гос. соц. помощи",
            "department": "Министерство социального развития ПК",
            "tags": [
                "обещали позвонить",
                "звонка так и не было"
            ]
        },
        {
            "date": null,
            "fulltext": "Добрый день, подскажите когда и где осуществляется запись на ЕГЭ выпускникам прошлых лет. Спасибо.",
            "address": "Северная 44",
            "group": "Образование",
            "category": "ЕГЭ, ОГЭ",
            "department": "Министерство образования",
            "tags": [
                "запись на ЕГЭ",
                "выпускникам прошлых лет"
            ]
        },
    ]
}
}
