import { Controller, Get, Post } from '@nestjs/common';

@Controller('data')
export class DataController {
@Get('single')
public async mockDataSingleReport()
{
    return{
        "date": null,
        "fulltext": "А территорию детских садов когда будут обрабатывать?",
        "address": "2-я Болдовская 8/2",
        "department": "Водоканал",
        "category": "Прорвало трубы",
        "category group": "HZ",
        "tags": [
            "трубы",
            "прорвало",
            "подвал",
            "пятиэтажка"
        ]
    }
}

@Get('multiple')
public async mockDataMultipleReports()
{
    return [
        {   
            "date": null,
            "fulltext": "А территорию детских садов когда будут обрабатывать?",
            "address": "2-я Болдовская 8/2",
            "group": "Безопасность",
            "category": "Безопасность общественных пространств",
            "department": "Губахинский городской округ",
            "tags": [
                "садов",
                "обрабатывать",
                "детских"
            ]
        },
        {
            "date": null,
            "fulltext": "Добрый день! А врача на дом можно будет вызвать?",
            "address": "Магистральная 50",
            "group": "Здравоохранение/Медицина",
            "category": "Технические проблемы с записью на прием к врачу",
            "department": "Министерство здравоохранения",
            "tags": [
                "врача",
                "вызвать"
            ]
        },
        {
            "date": null,
            "fulltext": "На улице Гагарина дом 6 лет десять колодцы закрыты досками. УК не обращает никакого внимания.",
            "address": "Гагарина 6",
            "group": "Благоустройство",
            "category": "Открытые канализационные люки",
            "department": "Губахинский городской округ",
            "tags": [
                "колодцы закрыты",
                "УК"
        
            ]
        },
        {
            "date": null,
            "fulltext": "А второй люк остался открытым, и там не видно дна, т. е. Глубины большой.",
            "address": "Ленина 20",
            "group": "Благоустройство",
            "category": "Открытые канализационные люки",
            "department": "Губахинский городской округ",
            "tags": [
                "люк",
                "открытым"
        
            ]
        },
        {
            "date": null,
            "fulltext": "Почему завалили мусором город? Почему не убирают",
            "address": "Малунцева 6",
            "group": "Благоустройство",
            "category": "Уборка территорий",
            "department": "Лысьвенский городской округ",
            "tags": [
                "завалаили мусором",
                "не убирают"
        
            ]
        },
        {
            "date": null,
            "fulltext": "Здравствуйте! Хочу поинтересоваться. Могут ли взиматься с выпускника деньги за получение аттестат ученика 9 класса?",
            "address": "Магистральная 52",
            "group": "Образование",
            "category": "Образовательный процесс",
            "department": "Министерство образования",
            "tags": [
                "выпускника",
                "аттестат",
                "класса"
            ]
        },
        {
            "date": null,
            "fulltext": "А Суворова 29 когда будут сносить дом?",
            "address": "Суворова 29",
            "group": "Социальное обслуживание и защита",
            "category": "Аварийное жилье/переселение",
            "department": "Лысьвенский городской округ",
            "tags": [
                "сносить",
                "дом"
              
            ]
        },
        {
            "date": null,
            "fulltext": "По ул.Ленина пока лампы не горят. Время-21,30.",
            "address": "Ленина 40",
            "group": "Благоустройство",
            "category": "Неисправные фонари освещения",
            "department": "Бардымский муниципальный округ Пермского края",
            "tags": [
                "лампы",
                "не горят"
              
            ]
        },
        {
            "date": null,
            "fulltext": "Здравствуйте может кто-то поможет городу Красновишерск полный бардак везде мусор",
            "address": "Багратиона 12",
            "group": "Мусор/Свалки/ТКО",
            "category": "Уборка/Вывоз мусора",
            "department": "АО ПРО ТКО",
            "tags": [
                "полный бардак",
                "везде мусор"
              
            ]
        },
        {
            "date": null,
            "fulltext": "я в положении вызвала врача на дом так и не приехал ни кто, в итоге позвонила на следующий день мне сказали выезжаем только к людям старше 60 лет вышел приказ минздрава это было на Репина 21",
            "address": "Репина 21",
            "group": "Здравоохранение/Медицина",
            "category": "Оказание медицинской помощи не в полном объеме/отказ в оказании медицинской помощи",
            "department": "Министерство здравоохранения",
            "tags": [
                "вызвала врача",
                "не приехал ни кто"
              
            ]
        },
        {
            "date": null,
            "fulltext": "До ГКП 4 невозможно дозвониться ни по одному из номеров. За сегодня совершила более 60 попыток дозвона - или занято или не берут. ПЦР положительный от 24.01, приехали 26.01, обещали повторно приехать на ПЦР через 10 дней, но тишина.",
            "address": "Истомина 67",
            "group": "Здравоохранение/Медицина",
            "category": "Технические проблемы с записью на прием к врачу",
            "department": "Министерство здравоохранения",
            "tags": [
                "невозможно дозвониться",
                "не берут",
                "тишина"
              
            ]
        },
        {
            "date": null,
            "fulltext": "До ГКП 4 невозможно дозвониться ни по одному из номеров. За сегодня совершила более 60 попыток дозвона - или занято или не берут. ПЦР положительный от 24.01, приехали 26.01, обещали повторно приехать на ПЦР через 10 дней, но тишина.",
            "address": "Мира 2",
            "group": "Здравоохранение/Медицина",
            "category": "Технические проблемы с записью на прием к врачу",
            "department": "Министерство здравоохранения",
            "tags": [
                "невозможно дозвониться",
                "не берут",
                "тишина"
              
            ]
        },
        {
            "date": null,
            "fulltext": "Хочу быть мэром! Я бы весь город сама лично отмыла и проконтролировала. Обожаю чистоту и порядок!!! У меня в Левшино лёд не чистят у подъезда, все люди уже ноги себе переломали",
            "address": "Маркса 90",
            "group": "Благоустройство",
            "category": "Нарушение правил уборки от снега и наледи внутридворового проезда, тротуара, площади",
            "department": "ИГЖН ПК",
            "tags": [
                "лёд",
                "не чистят у подъезда"
              
            ]
        },
        
        {
            "date": null,
            "fulltext": "На вышке целинная 31Б вообще завалили проход и магазин горой снега, это как вообще?!",
            "address": "Целинная 31Б",
            "group": "Благоустройство",
            "category": "Нарушение правил уборки и вывоза загрязненного снега и наледи на газоне",
            "department": "Город Пермь",
            "tags": [
                "завалили проход",
                "горой снега"
              
            ]
        },
        {
            "date": null,
            "fulltext": "Мало то что снега по уши, ещё и отопления и горячей воды нет. Субботу сидели без отопления и гор. воды и сегодня (понедельник)Плюсом управляющая компания берет деньги, а не убирается в подъездах совсем.Ул. Чернышевского",
            "address": "Чернышевского 33",
            "group": "ЖКХ",
            "category": "Ненадлежащее качество или отсутствие отопления",
            "department": "ИГЖН ПК",
            "tags": [
                "без отопления",
                "отопления и горячей воды нет"
              
            ]
        },
        {
            "date": null,
            "fulltext": "Нужно администрации сделать тротуар и ограждение, а то получается приходится ходить по обочине дороги со страхом тк машины летают!!",
            "address": "Дзержинского 7",
            "group": "Дороги",
            "category": "Содержание, ремонт и обустройство тротуаров",
            "department": "Александровский муниципальный округ Пермского края",
            "tags": [
                "сделать тротуар и ограждение",
                "проходиться ходить по обочине"
              
            ]
        },
        {
            "date": null,
            "fulltext": "В Перми улицу Плеханова залило горячей водой.",
            "address": "Плеханова 1",
            "group": "ЖКХ",
            "category": "Прорыв трубы/трубопровода",
            "department": "Город Пермь",
            "tags": [
                "залило",
                "горячей водой"
            ]
        },
        {
            "date": null,
            "fulltext": "У нас в городе нет ни одной остановки, где бы не висели объявления. Пора бы уже что то предпринимать. Можно же сделать для объявлений специальные места. Вдобавок к этому некоторые остановки поломаны и осколки стекол держаться за счет этих же объявлений",
            "address": "Поворотная 30",
            "group": "Общественный транспорт",
            "category": "Содержание остановок",
            "department": "Город Пермь",
            "tags": [
                "нет ни одной остановки",
                "специальные места",
                "остановки поломаны",
                "осколки стекол"
            ]
        },
        {
            "date": null,
            "fulltext": "Здравствуйте! Специалисты обещали позвонить в пятницу, край понедельник по моему вопросу, звонка так и не было",
            "address": "Северная 44",
            "group": "Социальное обслуживание и защита",
            "category": "Оказание гос. соц. помощи",
            "department": "Министерство социального развития ПК",
            "tags": [
                "обещали позвонить",
                "звонка так и не было"
            ]
        },
        {
            "date": null,
            "fulltext": "Добрый день, подскажите когда и где осуществляется запись на ЕГЭ выпускникам прошлых лет. Спасибо.",
            "address": "Северная 44",
            "group": "Образование",
            "category": "ЕГЭ, ОГЭ",
            "department": "Министерство образования",
            "tags": [
                "запись на ЕГЭ",
                "выпускникам прошлых лет"
            ]
        },
    ]
}

@Get('themes')
public async getThemes()
{
    return {
        "Безопасность":[
            {"value": "Безопасность общественных пространств", "label": "Безопасность общественных пространств"}, 
            {"value": "Отлов безнадзорных собак и кошек", "label": "Отлов безнадзорных собак и кошек"},
            {"value": "Беженцы", "label": "Беженцы"}
        ], 
        "Благоустройство":  [
            {"value": "Ямы во дворах", "label": "Ямы во дворах"}, 
            {"value": "Предложение по благоустройству", "label": "Предложение по благоустройству"},
            {"value": "Борщевик Сосновского", "label": "Борщевик Сосновского"},
            {"value": "Парки и зоны отдыха", "label": "Парки и зоны отдыха"},
            {"value": "Уборка территорий", "label": "Уборка территорий"},
            {"value": "Благоустройство общественного пространства (парк, сквер, пешеходная зона, бульвар, набережная, центральная улица или площадь)", "label": "Благоустройство общественного пространства (парк, сквер, пешеходная зона, бульвар, набережная, центральная улица или площадь)"},
            {"value": "Нарушение правил уборки от снега и наледи внутридворового проезда, тротуара, площади", "label": "Нарушение правил уборки от снега и наледи внутридворового проезда, тротуара, площади"},
            {"value": "Ненадлежащее содержание зеленых насаждений (газонов)/деревьев и кустарников", "label": "Ненадлежащее содержание зеленых насаждений (газонов)/деревьев и кустарников"},
            {"value": "Вырубка деревьев, кустарников", "label": "Вырубка деревьев, кустарников"},
            {"value": "Открытые канализационные люки", "label": "Открытые канализационные люки"},
            {"value": "Разрушение тротуаров и пешеходных дорожек", "label": "Разрушение тротуаров и пешеходных дорожек"},
            {"value": "Отсутствие детских площадок", "label": "Отсутствие детских площадок"},
            {"value": "Отсутствие урн, лавочек в общественных местах и дворовой территории", "label": "Отсутствие урн, лавочек в общественных местах и дворовой территории"},
            {"value": "Нарушение правил проведения земляных работ", "label": "Нарушение правил проведения земляных работ"},
            {"value": "Нарушение правил уборки и вывоза порубочных остатков", "label": "Нарушение правил уборки и вывоза порубочных остатков"},
            {"value": "Обустройство асфальтового покрытия парковки, внутридворового проезда, тротуара, пешеходной дорожки, въезда во двор", "label": "Обустройство асфальтового покрытия парковки, внутридворового проезда, тротуара, пешеходной дорожки, въезда во двор"},
            {"value": "Благоустройство придомовых территорий", "label": "Благоустройство придомовых территорий"},
            {"value": "Нарушение правил уборки и вывоза загрязненного снега и наледи на газоне", "label": "Нарушение правил уборки и вывоза загрязненного снега и наледи на газоне"},
            {"value": "Ненадлежащее состояние игровых элементов на детской или спортивной площадке", "label": "Ненадлежащее состояние игровых элементов на детской или спортивной площадке"},
            {"value": "Подтопление территории", "label": "Подтопление территории"},
            {"value": "Нарушение правил уборки внутридворового проезда, пешеходной дорожки", "label": "Нарушение правил уборки внутридворового проезда, пешеходной дорожки"},
            {"value": "Нарушение правил уборки от снега и наледи детской игровой и спортивной площадки", "label": "Нарушение правил уборки от снега и наледи детской игровой и спортивной площадки"},
            {"value": "Нарушение правил уборки от снега и наледи территории парка и сквера", "label": "Нарушение правил уборки от снега и наледи территории парка и сквера"},
            {"value": "Неисправные фонари освещения", "label": "Неисправные фонари освещения"},
            {"value": "Парковка на газонах", "label": "Парковка на газонах"},
            {"value": "Ненадлежащее состояние фасадов нежилых зданий, объектов и ограждений", "label": "Ненадлежащее состояние фасадов нежилых зданий, объектов и ограждений"},
            {"value": "Отсутствие общественных туалетов", "label": "Отсутствие общественных туалетов"},
            {"value": "Отсутствие фонарей освещения", "label": "Отсутствие фонарей освещения"},
            {"value": "Самовольная установка ограждений на территории общего пользования", "label": "Самовольная установка ограждений на территории общего пользования"},
            {"value": "Установка ограждений, препятствующих въезду на тротуар, газон на дворовой территории МКД", "label": "Установка ограждений, препятствующих въезду на тротуар, газон на дворовой территории МКД"}
        ],
        "ЖКХ":[
            {"value": "Засор в общедомовой системе водоотведения (канализации)", "label": "Засор в общедомовой системе водоотведения (канализации)"}, 
            {"value": "Затопление подъездов, подвальных помещений", "label": "Затопление подъездов, подвальных помещений"},
            {"value": "Наледь и сосульки на кровле", "label": "Наледь и сосульки на кровле"},
            {"value": "Несанкционированные надписи, рисунки, реклама на фасаде МКД", "label": "Несанкционированные надписи, рисунки, реклама на фасаде МКД"},
            {"value": "Прорыв трубы/трубопровода", "label": "Прорыв трубы/трубопровода"},
            {"value": "Протечки с кровли (системы водостока)", "label": "Протечки с кровли (системы водостока)"},
            {"value": "Дезинфекция МКД", "label": "Дезинфекция МКД"},
            {"value": "Другие проблемы с общедомовой системой водоотведения (канализации)", "label": "Другие проблемы с общедомовой системой водоотведения (канализации)"},
            {"value": "Жалобы на управляющие компании", "label": "Жалобы на управляющие компании"},
            {"value": "Завышение платы за коммунальные услуги", "label": "Завышение платы за коммунальные услуги"},
            {"value": "Залитие квартиры", "label": "Залитие квартиры"},
            {"value": "Неисправность выступающих конструкций: балконов, козырьков, эркеров, карнизов входных крылец и т. п.", "label": "Неисправность выступающих конструкций: балконов, козырьков, эркеров, карнизов входных крылец и т. п."},
            {"value": "Некачественно выполненный ремонт дорог", "label": "Некачественно выполненный ремонт дорог"},
            {"value": "Некачественный капитальный ремонт", "label": "Некачественный капитальный ремонт"},
            {"value": "Ненадлежащая уборка подъездов и лифтов", "label": "Ненадлежащая уборка подъездов и лифтов"},
            {"value": "Ненадлежащее качество или отсутствие отопления", "label": "Ненадлежащее качество или отсутствие отопления"},
            {"value": "Ненадлежащее содержание и эксплуатация МКД", "label": "Ненадлежащее содержание и эксплуатация МКД"},
            {"value": "Непригодные для проживания жилые помещения", "label": "Непригодные для проживания жилые помещения"},
            {"value": "Низкая температура воды/слабое давление", "label": "Низкая температура воды/слабое давление"},
            {"value": "Отсутствие горячей воды", "label": "Отсутствие горячей воды"},
            {"value": "Отсутствие холодной воды", "label": "Отсутствие холодной воды"},
            {"value": "Отсутствие электричества", "label": "Отсутствие электричества"},
            {"value": "Перепланировка и реконструкция помещений", "label": "Перепланировка и реконструкция помещений"},
            {"value": "Плата за ЖКУ и работа ЕИРЦ", "label": "Плата за ЖКУ и работа ЕИРЦ"},
            {"value": "Плохое качество воды", "label": "Плохое качество воды"},
            {"value": "Подключение к водоснабжению", "label": "Подключение к водоснабжению"},
            {"value": "Ремонт подъездов", "label": "Ремонт подъездов"},
            {"value": "Сборы за капитальный ремонт", "label": "Сборы за капитальный ремонт"}
        ], 
        "Связь и телевидение":[
            {"value": "Информационно-техническая поддержка", "label": "Информационно-техническая поддержка"}
        ], 
        "Дороги":[
            {"value": "Нарушение правил очистки дорог от снега и наледи/Обращения о необходимости очистить тротуар от снега и наледи", "label": "Нарушение правил очистки дорог от снега и наледи/Обращения о необходимости очистить тротуар от снега и наледи"}, 
            {"value": "Некачественно нанесенная разметка на проезжей части", "label": "Некачественно нанесенная разметка на проезжей части"},
            {"value": "Несоблюдение правил уборки проезжей части", "label": "Несоблюдение правил уборки проезжей части"},
            {"value": "Ливневые канализации (строительство и реконструкция)", "label": "Ливневые канализации (строительство и реконструкция)"},
            {"value": "Нарушение технологии и (или) сроков производства работ", "label": "Нарушение технологии и (или) сроков производства работ"},
            {"value": "Необходима установка и замена дорожных ограждений", "label": "Необходима установка и замена дорожных ограждений"},
            {"value": "Несанкционированное ограничение движения, помехи движению, захват земли в полосе отвода автодорог", "label": "Несанкционированное ограничение движения, помехи движению, захват земли в полосе отвода автодорог"},
            {"value": "Организация парковок", "label": "Организация парковок"},
            {"value": "Организация переходов, светофоров/Изменить организацию движения", "label": "Организация переходов, светофоров/Изменить организацию движения"},
            {"value": "Освещение неисправно или отсутствует", "label": "Освещение неисправно или отсутствует"},
            {"value": "Подтопление автомобильных дорог", "label": "Подтопление автомобильных дорог"},
            {"value": "Предложение дороги в план ремонта", "label": "Предложение дороги в план ремонта"},
            {"value": "Предложить установку нового лежачего полицейского (ИДН)", "label": "Предложить установку нового лежачего полицейского (ИДН)"},
            {"value": "Пробки", "label": "Пробки"},
            {"value": "Работа светофора (установка, изменение режима работы, оборудование кнопкой вызова)", "label": "Работа светофора (установка, изменение режима работы, оборудование кнопкой вызова)"},
            {"value": "Ремонт дороги", "label": "Ремонт дороги"},
            {"value": "Ремонт/строительство мостов", "label": "Ремонт/строительство мостов"},
            {"value": "Содержание дорожных знаков/Установка новых дорожных знаков, с внесением в схему дислокации, замена старых знаков на новые", "label": "Содержание дорожных знаков/Установка новых дорожных знаков, с внесением в схему дислокации, замена старых знаков на новые"},
            {"value": "Содержание, ремонт и обустройство тротуаров", "label": "Содержание, ремонт и обустройство тротуаров"},
            {"value": "Строительство или реконструкция дорог", "label": "Строительство или реконструкция дорог"},
            {"value": "Ямы и выбоины на дороге", "label": "Ямы и выбоины на дороге"}
        ], 
        "Торговля":[
            {"value": "Нестационарная торговля (киоски, павильоны, сезонная торговля)", "label": "Нестационарная торговля (киоски, павильоны, сезонная торговля)"} 
        ], 
        "Здравоохранение/Медицина":[
            {"value": "Оказание медицинской помощи не в полном объеме/отказ в оказании медицинской помощи", "label": "Оказание медицинской помощи не в полном объеме/отказ в оказании медицинской помощи"}, 
            {"value": "Питание в медицинских учреждениях", "label": "Питание в медицинских учреждениях"}, 
            {"value": "Просьбы о лечении", "label": "Просьбы о лечении"}, 
            {"value": "Скорая помощь", "label": "Скорая помощь"}, 
            {"value": "Вакцинация", "label": "Вакцинация"}, 
            {"value": "Диспансеризация", "label": "Диспансеризация"}, 
            {"value": "Здравоохранение прочее", "label": "Здравоохранение прочее"}, 
            {"value": "Нехватка или сокращение врачей и медицинских учреждений", "label": "Нехватка или сокращение врачей и медицинских учреждений"}, 
            {"value": "Нехватка материально-технического обеспечения", "label": "Нехватка материально-технического обеспечения"}, 
            {"value": "Низкая заработная плата врачей", "label": "Низкая заработная плата врачей"}, 
            {"value": "Отсутствие аптек", "label": "Отсутствие аптек"}, 
            {"value": "Отсутствие лекарств в аптеках", "label": "Отсутствие лекарств в аптеках"}, 
            {"value": "Отсутствие лекарств в стационарах", "label": "Отсутствие лекарств в стационарах"}, 
            {"value": "Очередь", "label": "Очередь"}, 
            {"value": "Ошибки врачей, халатность", "label": "Ошибки врачей, халатность"}, 
            {"value": "Предложения по созданию лечебных центров", "label": "Предложения по созданию лечебных центров"}, 
            {"value": "Профильный осмотр", "label": "Профильный осмотр"}, 
            {"value": "Содержание больниц", "label": "Содержание больниц"}, 
            {"value": "Социальная поддержка медперсонала", "label": "Социальная поддержка медперсонала"}, 
            {"value": "Технические проблемы с записью на прием к врачу", "label": "Технические проблемы с записью на прием к врачу"}, 
            {"value": "Хамство медицинских работников", "label": "Хамство медицинских работников"} 
        ], 
        "Мусор/Свалки/ТКО":[
            {"value": "Отсутствие контейнерной площадки/Проезд к контейнерной площадке", "label": "Отсутствие контейнерной площадки/Проезд к контейнерной площадке"}, 
            {"value": "Стихийные свалки в городе/в парках/в лесу", "label": "Стихийные свалки в городе/в парках/в лесу"}, 
            {"value": "Уборка/Вывоз мусора", "label": "Уборка/Вывоз мусора"},
            {"value": "Выброс мусора нарушителем", "label": "Выброс мусора нарушителем"},
            {"value": "Льготные лекарства", "label": "Льготные лекарства"},
            {"value": "Плата за вывоз ТКО", "label": "Плата за вывоз ТКО"},
            {"value": "Проблемы с контейнерами", "label": "Проблемы с контейнерами"},
            {"value": "Раздельная сортировка отходов", "label": "Раздельная сортировка отходов"},
            {"value": "Строительство объектов по обращению с отходами", "label": "Строительство объектов по обращению с отходами"}
        ], 
        "Электроснабжение":[
            {"value": "Повреждение опор ЛЭП", "label": "Повреждение опор ЛЭП"}, 
            {"value": "Качество электроснабжения", "label": "Качество электроснабжения"} 
        ], 
        "Социальное обслуживание и защита":[
            {"value": "Аварийное жилье/переселение", "label": "Аварийное жилье/переселение"}, 
            {"value": "Волонтерство", "label": "Волонтерство"}, 
            {"value": "Дети и многодетные семьи", "label": "Дети и многодетные семьи"}, 
            {"value": "Задержка выплат гражданам", "label": "Задержка выплат гражданам"}, 
            {"value": "Занятость и трудоустройство", "label": "Занятость и трудоустройство"}, 
            {"value": "Инвалиды", "label": "Инвалиды"}, 
            {"value": "Матери-одиночки, подростки", "label": "Матери-одиночки, подростки"}, 
            {"value": "Оказание гос. соц. помощи", "label": "Оказание гос. соц. помощи"}, 
            {"value": "Пенсионеры и ветераны", "label": "Пенсионеры и ветераны"}, 
            {"value": "Создание доступной среды для инвалидов", "label": "Создание доступной среды для инвалидов"}, 
            {"value": "Соц.обслуживание прочее", "label": "Соц.обслуживание прочее"}, 
            {"value": "Улучшение жилищных условий", "label": "Улучшение жилищных условий"}
        ],
        "Образование":[
            {"value": "Безопасность образовательного процесса", "label": "Безопасность образовательного процесса"}, 
            {"value": "ВУЗы и ССУЗы", "label": "ВУЗы и ССУЗы"}, 
            {"value": "Выплаты стипендий", "label": "Выплаты стипендий"}, 
            {"value": "Дистанционное образование", "label": "Дистанционное образование"},
            {"value": "Дополнительное образование", "label": "Дополнительное образование"},  
            {"value": "ЕГЭ, ОГЭ", "label": "ЕГЭ, ОГЭ"},  
            {"value": "Зарплата учителей", "label": "Зарплата учителей"},  
            {"value": "Кадровые перестановки", "label": "Кадровые перестановки"}, 
            {"value": "Нехватка мест в школах", "label": "Нехватка мест в школах"},   
            {"value": "Образовательный процесс", "label": "Образовательный процесс"},   
            {"value": "Общее впечатление", "label": "Общее впечатление"},   
            {"value": "Питание", "label": "Питание"},   
            {"value": "Проблемы с отоплением детских садов и школ", "label": "Проблемы с отоплением детских садов и школ"},   
            {"value": "Содержание гос. образовательных организаций", "label": "Содержание гос. образовательных организаций"},   
            {"value": "Социальная поддержка учителей", "label": "Социальная поддержка учителей"},   
            {"value": "Социальные учреждения", "label": "Социальные учреждения"},   
            {"value": "Строительство школ, детских садов", "label": "Строительство школ, детских садов"},   
            {"value": "Устройство в ДОУ", "label": "Устройство в ДОУ"}  
        ], 
        "Газ и топливо":[
            {"value": "Восстановление газоснабжения", "label": "Восстановление газоснабжения"}, 
            {"value": "Запрос на газификацию и её условия", "label": "Запрос на газификацию и её условия"}, 
            {"value": "Сроки газификации", "label": "Сроки газификации"}, 
            {"value": "Стоимость, оплата и возврат средств на газификацию", "label": "Стоимость, оплата и возврат средств на газификацию"} 
        ], 
        "Экология":[
            {"value": "Выбросы вредных веществ в атмосферу/загрязнение воздуха", "label": "Выбросы вредных веществ в атмосферу/загрязнение воздуха"} 
        ], 
        "МФЦ 'Мои документы'":[
            {"value": "Государственные услуги", "label": "Государственные услуги"}, 
            {"value": "МФЦ 'Мои документы'", "label": "МФЦ 'Мои документы'"} 
        ], 
        "Общественный транспорт":[
            {"value": "График движения общественного транспорта", "label": "График движения общественного транспорта"}, 
            {"value": "Добавить новый маршрут", "label": "Добавить новый маршрут"}, 
            {"value": "Изменение класса и количества автобусов", "label": "Изменение класса и количества автобусов"}, 
            {"value": "Изменить или отменить маршрут", "label": "Изменить или отменить маршрут"}, 
            {"value": "Льготы на проезд и тарифы", "label": "Льготы на проезд и тарифы"}, 
            {"value": "Некорректное поведение водительского состава", "label": "Некорректное поведение водительского состава"},
            {"value": "Неудовлетворительные условия проезда в транспорте на действующем маршруте", "label": "Неудовлетворительные условия проезда в транспорте на действующем маршруте"},  
            {"value": "Отсутствие остановочных пунктов", "label": "Отсутствие остановочных пунктов"},  
            {"value": "Пешеходные переходы и жд переезды", "label": "Пешеходные переходы и жд переезды"},  
            {"value": "Проблемы с социальными картами или проездными документами", "label": "Проблемы с социальными картами или проездными документами"},  
            {"value": "Содержание остановок", "label": "Содержание остановок"}  
        ], 
        "Коронавирус":[
            {"value": "Доступность вакцин", "label": "Доступность вакцин"}, 
            {"value": "Жалобы на врачей", "label": "Жалобы на врачей"}, 
            {"value": "Коронавирус", "label": "Коронавирус"}, 
            {"value": "Коронавирусные ограничения", "label": "Коронавирусные ограничения"}, 
            {"value": "Порядок и пункты вакцинации", "label": "Порядок и пункты вакцинации"}, 
            {"value": "Проблемы в работе горячих линий", "label": "Проблемы в работе горячих линий"}, 
            {"value": "Самоизоляция и карантин", "label": "Самоизоляция и карантин"}, 
            {"value": "Сертификаты и QR-коды", "label": "Сертификаты и QR-коды"}, 
            {"value": "Тесты на коронавирус", "label": "Тесты на коронавирус"} 
        ], 
        "Мобилизация":[
            {"value": "Зарплата, компенсации, поощрения, выплаты", "label": "Зарплата, компенсации, поощрения, выплаты"}, 
            {"value": "Поддержка семей мобилизованных", "label": "Поддержка семей мобилизованных"} 
        ], 
        "Роспотребнадзор":[
            {"value": "Обработка и уничтожение грызунов (дератизация)", "label": "Обработка и уничтожение грызунов (дератизация)"}, 
            {"value": "Санитарно-эпидемиологическое благополучие", "label": "Санитарно-эпидемиологическое благополучие"} 
        ], 
        "Памятники и объекты культурного наследия":[
            {"value": "Памятники и объекты культурного наследия", "label": "Памятники и объекты культурного наследия"} 
        ], 
        "Погребение и похоронное дело":[
            {"value": "Погребение и похоронное дело", "label": "Погребение и похоронное дело"} 
        ], 
        "Государственная собственность":[
            {"value": "Региональное имущество", "label": "Региональное имущество"} 
        ], 
        "Физическая культура и спорт":[
            {"value": "Ремонт спортивных учреждений", "label": "Ремонт спортивных учреждений"}, 
            {"value": "Спортивные мероприятия", "label": "Спортивные мероприятия"}, 
            {"value": "Строительство спортивной инфраструктуры", "label": "Строительство спортивной инфраструктуры"} 
        ], 
        "Строительство и архитектура":[
            {"value": "Состояние зданий учреждений и организаций", "label": "Состояние зданий учреждений и организаций"}, 
            {"value": "Строительство зданий", "label": "Строительство зданий"}, 
            {"value": "Строительство социальных объектов", "label": "Строительство социальных объектов"} 
        ], 
        "Спецпроекты":[
            {"value": "Спецпроекты", "label": "Спецпроекты"} 
        ], 
        "Культура":[
            {"value": "Учреждения культуры", "label": "Учреждения культуры"} 
        ], 
        "Экономика и бизнес":[
            {"value": "Цены и ценообразование", "label": "Цены и ценообразование"} 
        ]
        }
}
}
